#+TITLE: Ejercicios del capitulo dos.
* Ejercicios
  1) ¿Cuantos tipos de datos hay para reresentar numeros enteros?¿En que difieren?
     En *Java* los enteros se representan con la palabra reservada *int*
  2) ¿Cual es el objetivo de una declaracion?
     Que el compilador reserve espacio para cada dato que declaramos y para que podamos manipular dichos datos en el programa.
     Todos los datos, incluyendo los objetos, deben estar declarados antes de su uso.
  3) Si se tiene la declaracion 
     #+BEGIN_SRC java
       final int UNO = 1;
     #+END_SRC
     ¿Es posible tener la siguiente instruccion?
     #+BEGIN_SRC java
       int negativo = -UNO;
     #+END_SRC
     Si es posible ya que la variable UNO no se cambia en ningun momento(que es *final*).
  4) Indica tres formas distintas de incrementar en 1 el valor de una variable.
     #+BEGIN_SRC java
       int variable = 0;
       variable ++; //Manera 1
       variable += 1; //Manera 2
       variable = variable + 1; //Manera 3
     #+END_SRC
  5) ¿Es correcta la siguiente linea de codigo?¿por que?
     #+BEGIN_SRC java
       int posicion // Indica la posicion del objeto ;
     #+END_SRC
     Es sintacticamente incorrecta, el *;* es detectado por el compilador como un simple comentario.
  6) ¿Existe alguna diferencia entre tener *bancario* y *\\"bancario"\\*?
     Si, ya que la primera es el nombre de una variable y la segunda es una cadena.
  7) ¿cuales de las siguientes cadenas no pueden ser identificadores en Java?¿porque?
     | java.awt.Graphics | *.* caracter no valido en la declaracion de indentificador           |
     | rayos-x           | *-* caracter no valido en la declaracion de indentificador           |
     | _123              | Si puede ser un identificor en Java, cumple con las sintaxtis        |
     | valor calculado   | Identificadores no pueden tener espacio                              |
     | valorCalculado    | Identificador valido                                                 |
     | void              | No puede ser un Identificador, es una palabra reservada              |
     | Void              | Identificador valido, pero se recomienda que cominecen con minuscula |
     | 2diás             | Identificador incorrecto, no pueden iniciar con numeros              |
     | segundaBase       | Identificador correcto                                               |
     | x                 | Identificador correcto                                               |
  8) ¿Es verdadero o falso que en Java 1/3 es distinto de 1.0/3.0?¿por que?
     Es verdadero la primera da como resultado 0 y la segunda 0.333333 i.e. la primera es de tipo int y la segunda
     de tipo Double
  9) ¿Cuando es verdadera la siguiente ecuacion *(a/b)*b + (a%b) == a*?
     #+BEGIN_SRC java :classname test :results output :export both
       public class test {
           public static void main(String[] args) {
               int a = 0, b = 9;
               System.out.println((a/b)*b + (a%b) == a);
           }
       }

     #+END_SRC

     #+RESULTS:
     : true

  10) Dadas las siguientes declaracion
      #+BEGIN_SRC java
        int x, y;
        float z = 3.1313f;
        double w = 3.1212;
        boolean verdad = true;
        long l = 45L, m;
      #+END_SRC
      Evaluar las siguientes expresiones siempre y cuando sea posible. En caso de no ser posible la evaluación
      justificar la respuesta.
      #+BEGIN_SRC java
        //a) Si es posible
        x = 6;
        //b) si es posible
        y = 1000;
        //c) no es posible ya que no es de tipo entero(tipos incompatibles)
        y = 2.33333;
        //d) no es posible, no tiene tipo
        25 ++;
        //e) no es posible, no pueden llevar comas
        w = 175, 000;
        //f) no es posible, tipos incompatibles
        verdad = 1;
        //g) no es posible, tipos incompatibles, possible lossy convertion
        z = 3.1416;
        //h) Si es posible
        m = x * 250;
        //i) no es posible, unexpected type
        (x + y) ++;
        //j) Si es posible
        y = 1;

      #+END_SRC
  11) Volver a escribir las siguientes expresiones usando asignacion combinada, si es posible.
      #+BEGIN_SRC java
        //a)
        x += 3 * y;
        //b)
        x += -b + 87;
        //c)
        x *= y - 10;
        //d)
        x *= 3 - y;
        //e)
        // esta expresion no puede llevar la asignacion combinada /= ya que cambiaria
        // el resultado
        x = (3 - y) / x;

      #+END_SRC
  12) Escribir el valor que tiene la variable /complejo/ después de ejecutar cada instrucción del siguiente código.
      #+BEGIN_SRC java :classname ejercicio12 :export both
        public class ejercicio12 {
            public static void main(String[] args) {
                final int FACTOR = 10;
                int a = 1;
                int b = 2;
                int complejo = a + b * 3 - a * b + 3;
                System.out.println(complejo);
            }
        }
      #+END_SRC

      #+RESULTS:
      : 8

  13) Escribir el valor que tienen las variables c y d despues de ejecutar cada instruccion del siguiente codigo.
            #+BEGIN_SRC java :classname ejercicio13 :export both
              public class ejercicio13 {
                  public static void main(String[] args) {
                      final int FACTOR = 10;
                      int a = 4;
                      int b = 6;
                      int c = (a + b) * FACTOR;
                      int d = a + b * FACTOR;
                      System.out.println("c = " + c);
                      System.out.println("d = " + d);
                  }
              }
      #+END_SRC

            #+RESULTS:
	    | c | = | 100 |
	    | d | = |  64 |

  14) Si se tiene una variable real /val/ que tiene su valor entre 0 y 10 y se desea calcular un valor proporcional entre 0 y 100.
      i.e. si val = 7 se espera que el valor de la variable /calculado/ sea 70, ¿ cual de las dos instrucciones siguientes es la correcta?
      #+BEGIN_SRC java
        //esta es la corrcta
        double calculado = (val/10) * 100;
      #+END_SRC
  15) 
      #+BEGIN_SRC java
        //a)
        double uno = Math.pow(a, 3) * (a + 1) * (a - 7);
        //b)
        double dos = 1 / (1 + Math.pow(x, 2));
        //c)
        int q = ( (t1 * t2) / (d - k)) + t2;
      #+END_SRC
  16) Definir constantes o variables para los siguientes casos

      a) el lado de un cuadrado de longitud 4.5 m -> CONSTANTE

      b) cien metros -> CONSTANTE

      c) el numero de llantas de una bicicleta -> CONSTANTE

      d) un numero primo -> VARIABLE

      e) la raiz cuadrada de 2 -> CONSTANTE

      f) una interrogacion -> VARIABLE

      g) el area de un cuadrado -> VARIABLE

  17) Si el costo de la gasolina es de $7.50 por litro, escribir una expresión que defina el valor de la variable real /total/ como el
      total a pagar por n litros de gasolina.
      #+BEGIN_SRC java
        double total = n * 7.50;
      #+END_SRC
